package com.qbt.common.enums;

/**
 *  短信模板Code
  * @ClassName: SmsTemplate
  * @Description: TODO
  * @author share 2016年8月16日
  * @modify share 2016年8月16日
 */
public enum SmsTemplate {

	M_113079			("113079","【球包通】验证码：{1}，请于{2}分钟内输入，请勿告诉别人。"),
	M_112387			("112387","【球包通】尊敬的用户您好，您已下单成功。快递员将在规定的时间内上门取包。订单号：{1}，支付时间：{2}，预约取包时间：{3}，寄件信息：{4}，收件信息：{5}，预计到达时间：{6}。请特别注意：因航空运输要求，液体、膏状物品（防晒霜、Mark笔等），磁性物品（带磁的MARK、果岭叉、球杆套等），含锂电池的电子产品（测距仪等），以及打火机、纸币及硬币等均不能随包寄出。请提前将上述物品拿出。另外，为配合安检，球包不能上锁。感谢您的配合，祝您打球愉快！如有任何疑问，请拨打：400-803-0106"),
	M_112388			("112388","【球包通】恭喜您的宝贝即将踏上旅途，订单号：{1}；支付时间：{2}；预约取包时间：{3}；寄件信息：{4}；收件信息：{5}；预计到达时间：{6}。我们会准时将宝贝送达，请保持手机畅通！如有疑问请联系客服，电话：400-803-0106。我们将以十分服务，回报您的信赖！祝您旅途愉快！"),
	M_112400			("112400","【球包通】尊敬的用户您好，您的订单已取消。订单号：{1}，预约取包时间：{2}，寄件信息：{3}，收件信息：{4}，预计到达时间：{5}，如有任何疑问，请拨打：400-803-0106"),
	M_112395			("112395","【球包通】尊敬的用户您好！您的球包已{1}收取成功，即将进入运输途中，订单号：{2}，寄件地址：{3}，收件地址：{4}。服务电话：400-803-0106。球包通伴您同行！"),
	M_113080			("113080","【球包通】您的球包已安全抵达{1}。服务电话：400-803-0106。球包通伴您同行!"),
	M_112397			("112397","【球包通】您的球包订单号{1}，已于{2}出发，寄件地址：{3}，收件地址：{4}，预计到达时间：{5}。服务电话：400-803-0106。球包通伴您同行！"),
	M_120206			("120539","【球包通】Attention Please {1} For Any Questions, Call {2} Please."),

	M_148037			("148037","【球包通】尊敬的{1}贵宾，您好！您已成功下单。我们顺丰工作人员会在预约时间内上门取包。实时查询球包动态请关注「球包通」微信公众号。订单号：{2}，支付时间：{3}，预约取包时间：{4}，取包信息：{5}，送包信息：{6}，预计到达时间：{7}。请特别注意：1、因航空运输要求，液体、膏状物品（防晒霜、Mark笔等），磁性物品（带磁的MARK、果岭叉、球杆套等），含锂电池的电子产品（测距仪等），以及打火机、纸币及硬币等均不能随包寄出。请提前将上述物品拿出。2、为保证您的球包及时出发，您无需上锁。感谢您的配合，祝您打球愉快！如有任何疑问，请拨打：400-803-0106"),
	M_148038			("148038","【球包通】恭喜您{1}贵宾，您的球包即将踏上旅途，实时查询球包动态请关注「球包通」微信公众号。订单号：{2}；支付时间：{3}；预约取包时间：{4}；取包信息：{5}；送包信息：{6}；预计到达时间：{7}。我们会准时将宝贝送达，请保持手机畅通！如有疑问请联系客服，电话：400-803-0106。我们将以十分服务，回报您的信赖！祝您旅途愉快！"),
	M_148039			("148039","【球包通】尊敬的{1}贵宾，您好！您的球包已{2}成功收取，正整装待发，实时查询球包动态请关注「球包通」微信公众号。订单号：{3}，取包地址：{4}，送包地址：{5}。如有疑问请联系客服，400-803-0106。球包通伴您同行！"),
	M_148040			("148040","【球包通】尊敬的{1}贵宾，您好！您的球包已愉快地踏上旅途，实时查询球包动态请关注「球包通」微信公众号。订单号{2}，已于{3}出发，取包地址：{4}，送包地址：{5}，预计到达时间：{6}。如有疑问请联系客服，400-803-0106。球包通伴您同行！"),
	M_148041			("148041","【球包通】尊敬的{1}贵宾，您好！您的球包已被愉快地签收了，球包（订单号为：{2}）已安全抵达{3}。如有疑问请联系客服，400-803-0106。了解更多信息请关注「球包通」微信公众号。球包通伴您同行！"),
	M_148043			("148043","【球包通】尊敬的{1}贵宾，您好！您的订单已取消，实时查询相关信息及动态请关注「球包通」微信公众号。订单号：{2}，预约取包时间：{3}，取包信息：{4}，送包信息：{5}，预计到达时间：{6}，如有任何疑问请联系客服；400-803-0106"),
	M_156321 			("156321","【球包通】尊敬的{1}贵宾，您好！您的订单已为您准备好，请于微信进行付款。付款成功后我们将准时上门收包并保证您的球包及时出发。如有任何疑问，请拨打：400-803-0106，谢谢!"),
	M_156596            ("156596","【球包通】尊敬的{1}，您代{2}下的订单尚未付款，请及时处理。如有任何疑问，请拨打：400-803-0106，谢谢!{3}"),
	
	M_162514			("162514","【球包通】尊敬的{1}贵宾，您好！您已成功下单。我们顺丰工作人员会在预约时间内上门取包。实时查询球包动态请关注「球包通」微信公众号。订单号：{2}，支付时间：{3}，预约取包时间：{4}，取包信息：{5}，送包信息：{6}，预计到达时间：{7}。请特别注意：1、因航空运输要求，液体、膏状物品（防晒霜、Mark笔等），磁性物品（带磁的MARK、果岭叉、球杆套等），含锂电池的电子产品（测距仪等），以及打火机、纸币及硬币等均不能随包寄出。请提前将上述物品拿出。2、为保证您的球包及时出发，您无需上锁。感谢您的配合，祝您打球愉快！如有任何疑问，请拨打：{8}"),
	M_162515			("162515","【球包通】恭喜您{1}贵宾，您的球包即将踏上旅途，实时查询球包动态请关注「球包通」微信公众号。订单号：{2}；支付时间：{3}；预约取包时间：{4}；取包信息：{5}；送包信息：{6}；预计到达时间：{7}。我们会准时将宝贝送达，请保持手机畅通！如有疑问请联系客服，电话：{8}。我们将以十分服务，回报您的信赖！祝您旅途愉快！"),
	M_162520			("162520","【球包通】尊敬的{1}贵宾，您好！您的球包已{2}成功收取，正整装待发，实时查询球包动态请关注「球包通」微信公众号。订单号：{3}，取包地址：{4}，送包地址：{5}。如有疑问请联系客服，{6}。球包通伴您同行！"),
	M_162523			("162523","【球包通】尊敬的{1}贵宾，您好！您的球包已愉快地踏上旅途，实时查询球包动态请关注「球包通」微信公众号。订单号{2}，已于{3}出发，取包地址：{4}，送包地址：{5}，预计到达时间：{6}。如有疑问请联系客服，{7}。球包通伴您同行！"),
	M_162525			("162525","【球包通】尊敬的{1}贵宾，您好！您的球包已被愉快地签收了，球包（订单号为：{2}）已安全抵达{3}。如有疑问请联系客服，{4}。了解更多信息请关注「球包通」微信公众号。球包通伴您同行！"),
	M_162527			("162527","【球包通】尊敬的{1}贵宾，您好！您的订单已取消，实时查询相关信息及动态请关注「球包通」微信公众号。订单号：{2}，预约取包时间：{3}，取包信息：{4}，送包信息：{5}，预计到达时间：{6}，如有任何疑问请联系客服；{7}"),
	M_162528			("162528","【球包通】尊敬的{1}贵宾，您好！您的订单已为您准备好，请于微信进行付款。付款成功后我们将准时上门收包并保证您的球包及时出发。如有任何疑问，请拨打：{2}，谢谢!"),
	M_164216			("164216","【球包通】尊敬的{1}，您代{2}下的订单尚未付款，请及时处理。如有任何疑问，请拨打：{3}，谢谢!{4}"),
	M_162624			("162624","【球包通】尊敬的{1}，您好！{2}，如有任何疑问，请拨打：{3}"),
	M_165047			("165047","【球包通】尊敬的{1}贵宾，您的球包（订单号：{2}）{3}地址已经修改，修改前：{4}，修改后：{5}，请知悉。如有任何疑问，请拨打：{6}，谢谢!"),
	
	M_176720            ("176720","【球包通】{1}贵宾，您的球包已由球包通承运。为保证您的球包安全踏上旅途，根据航空货运法规，请您取出{2}等航空违禁品，不要上锁，{3}。订单号：{4}，{5}。任何疑问请致电{6}。球包通伴您出行！"),
	M_176721            ("176721","【球包通】{1}贵宾，您的球包已由球包通启运，{2}。订单号：{3}，为安全、准时地把球包送至目的地，请保持手机畅通，方便我们与您取得联系！感谢您的支持与配合。任何疑问请致电{4}。球包通伴您出行！"),
	M_176723            ("176723","【球包通】{1}贵宾，球包通已将您的球包安全送达{2}，订单号：{3}，感谢您使用球包通，期待再次为您服务。任何疑问请致电{4}。{5}。球包通伴您出行！"),
	M_176724            ("176724","【球包通】{1}贵宾，您的订单：{2}已经取消。感谢您的支持与厚爱，期待下次为您服务。任何疑问请致电{3}。{4}。球包通伴您出行！"),
	M_176725            ("176725","【球包通】{1}贵宾，您的球包（订单号：{2}）地址已经修改，修改前：{3}，修改后：{4}。感谢您的支持与厚爱。任何疑问请致电{5}。{6}。球包通伴您出行！"),
	
	M_190132            ("190132","【球包通】{1}贵宾，感谢您使用球包通，您本次的订单{2}已经完成，{3}，祝您打球愉快。任何疑问请致电{4}。球包通伴您出行！"),
	;
	
	String code;
	String desc;

	private SmsTemplate(String code,String desc) { 
		this.code = code;
		this.desc = desc;
	}

	public String getCode() {
		return code;
	}

	public void setCode(String code) {
		this.code = code;
	}

	public String getDesc() {
		return desc;
	}

	public void setDesc(String desc) {
		this.desc = desc;
	}

	public static String getByCode(String code){
		if(code != null){
			for(SmsTemplate s : values()){
				if(s.getCode().equals(code)){
					return s.getDesc();
				}
			}
		}
		return null;
	}
}
